УчетВУправляющихДляГит1/src/Documents/ВосстановлениеНДСПоОбъектамНедвижимости/ВосстановлениеНДСПоОбъектамНедвижимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВосстановлениеНДСПоОбъектамНедвижимости</name>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПродаж</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВосстановлениеВКнигеПродаж</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетСписанияНДС</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоСписанияНДС1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоСписанияНДС2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоСписанияНДС3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеСписания</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыНедвижимости</name>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектНедвижимости</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользуетсяДляОперацийНеОблагаемыхНДС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаИспользованияДляОпераций</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВводаВЭксплуатациюБУ</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачисленияАмортизацииНУ</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьОбъектаНедвижимости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСПоПодряднымРаботам</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСПоСМРДляСобственногоПотребления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСПоОбъектуНедвижимости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоляВыручкиНеОблагаемаяНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСПоПодряднымРаботамВосстановлена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСПоСМРДляСобственногоПотребленияВосстановлена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСПоОбъектуНедвижимостиВосстановлена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СчетаФактуры</name>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦенности</name>
      <type>
        <types>EnumRef.ВидыЦенностей</types>
      </type>
    </attributes>
    <attributes>
      <name>КодОперацииДляДекларации</name>
      <type>
        <types>EnumRef.НДСКодыОперацийПоОбъектамНедвижимости</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетФактура</name>
      <type>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ГТДИмпорт</types>
        <types>DocumentRef.ВыкупПредметовЛизинга</types>
        <types>DocumentRef.СчетФактураВыданный</types>
        <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
        <types>DocumentRef.ПринятиеКУчетуОС</types>
        <types>DocumentRef.ПоступлениеНМА</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.МодернизацияОС</types>
        <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
        <types>DocumentRef.СчетФактураПолученный</types>
        <types>DocumentRef.ПоступлениеИзПереработки</types>
        <types>DocumentRef.ОтражениеНДСКВычету</types>
        <types>DocumentRef.НачислениеНДСпоСМРхозспособом</types>
        <types>DocumentRef.ПоступлениеДопРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНДСВосстановлена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДСВосстановлен</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УчетВУправляющихДляГит1/src/InformationRegisters/ВыполнениеРегламентныхОперацийНДС/ВыполнениеРегламентныхОперацийНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыполнениеРегламентныхОперацийНДС</name>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РегламентныйДокумент</name>
    <type>
      <types>DocumentRef.ФормированиеЗаписейКнигиПокупок</types>
      <types>DocumentRef.РаспределениеНДС</types>
      <types>DocumentRef.СчетФактураВыданный</types>
      <types>DocumentRef.ОперацияБух</types>
      <types>DocumentRef.ВосстановлениеНДС</types>
      <types>DocumentRef.ПодтверждениеНулевойСтавкиНДС</types>
      <types>DocumentRef.ФормированиеЗаписейРаздела7ДекларацииНДС</types>
      <types>DocumentRef.УдалитьРегистрацияОплатыНДСВБюджет</types>
      <types>DocumentRef.ПодтверждениеОплатыНДСВБюджет</types>
      <types>DocumentRef.ФормированиеЗаписейКнигиПродаж</types>
      <types>DocumentRef.НачислениеНДСпоСМРхозспособом</types>
      <types>DocumentRef.ВосстановлениеНДСПоОбъектамНедвижимости</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РегламентнаяОперация</name>
    <type>
      <types>EnumRef.РегламентныеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектТекущейОперации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/Documents/ВосстановлениеНДСПоОбъектамНедвижимости/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ОтражатьВосстановлениеВКнигеПродаж Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроведения = Документы.ВосстановлениеНДСПоОбъектамНедвижимости.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ
	
	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
		
	Документы.ВосстановлениеНДСПоОбъектамНедвижимости.СформироватьДвиженияКнигиПродаж(ПараметрыПроведения.КнигиПродаж, 
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
		
	Документы.ВосстановлениеНДСПоОбъектамНедвижимости.СформироватьДвиженияВосстановлениеНДС(
		ПараметрыПроведения.ВосстановлениеНДС, ПараметрыПроведения.Реквизиты, Движения, Отказ);
		
	РегистрыСведений.ВыполнениеРегламентныхОперацийНДС.СформироватьДвиженияФактВыполненияРегламентнойОперации(
		ПараметрыПроведения.ДанныеРегламентнойОперации, Отказ);	
		
	ПроведениеСервер.УстановитьЗаписьОчищаемыхНаборовЗаписей(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	РегистрыСведений.ВыполнениеРегламентныхОперацийНДС.СброситьФактВыполненияОперации(Ссылка);

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Исключаем из проверки реквизиты, заполнение которых стало необязательным:
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если НЕ ОтражатьВосстановлениеВКнигеПродаж Тогда 
		МассивНепроверяемыхРеквизитов.Добавить("СчетСписанияНДС");
	КонецЕсли;

	// Удаляем из проверяемых реквизитов все, по которым автоматическая проверка не нужна:
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры


#КонецЕсли
